apache/nuttx/arch/xtensa/src/esp32/esp32_qencoder.c
/* Per-pcnt state structures */

#ifdef CONFIG_ESP32_PCNT_U0_QE
static const struct esp32_qeconfig_s g_pcnt0config =
{
  .pcntid        = 0,
  .ch0_gpio      = CONFIG_ESP32_PCNT_U0_CH0_EDGE_PIN,
  .ch1_gpio      = CONFIG_ESP32_PCNT_U0_CH1_LEVEL_PIN,
  .ch0_pulse_sig = PCNT_SIG_CH0_IN0_IDX,
  .ch1_pulse_sig = PCNT_SIG_CH1_IN0_IDX,
  .ch0_ctrl_sig  = PCNT_CTRL_CH0_IN0_IDX,
  .ch1_ctrl_sig  = PCNT_CTRL_CH1_IN0_IDX,
  .filter_thres  = CONFIG_ESP32_PCNT_U0_FILTER_THRES,
};

static struct esp32_lowerhalf_s g_pcnt0lower =
{
  .ops      = &g_qecallbacks,
  .config   = &g_pcnt0config,
  .inuse    = false,
};
#endif

#ifdef CONFIG_ESP32_PCNT_U1_QE
static const struct esp32_qeconfig_s g_pcnt1config =
{
  .pcntid        = 1,
  .ch0_gpio      = CONFIG_ESP32_PCNT_U1_CH0_EDGE_PIN,
  .ch1_gpio      = CONFIG_ESP32_PCNT_U1_CH1_LEVEL_PIN,
  .ch0_pulse_sig = PCNT_SIG_CH0_IN1_IDX,
  .ch1_pulse_sig = PCNT_SIG_CH1_IN1_IDX,
  .ch0_ctrl_sig  = PCNT_CTRL_CH0_IN1_IDX,
  .ch1_ctrl_sig  = PCNT_CTRL_CH1_IN1_IDX,
  .filter_thres  = CONFIG_ESP32_PCNT_U1_FILTER_THRES,
};

static struct esp32_lowerhalf_s g_pcnt1lower =
{
  .ops      = &g_qecallbacks,
  .config   = &g_pcnt1config,
  .inuse    = false,
};
#endif

#ifdef CONFIG_ESP32_PCNT_U2_QE
static const struct esp32_qeconfig_s g_pcnt2config =
{
  .pcntid       = 2,
  .ch0_gpio     = CONFIG_ESP32_PCNT_U2_CH0_EDGE_PIN,
  .ch1_gpio     = CONFIG_ESP32_PCNT_U2_CH1_LEVEL_PIN,
  .ch0_pulse_sig = PCNT_SIG_CH0_IN2_IDX,
  .ch1_pulse_sig = PCNT_SIG_CH1_IN2_IDX,
  .ch0_ctrl_sig  = PCNT_CTRL_CH0_IN2_IDX,
  .ch1_ctrl_sig  = PCNT_CTRL_CH1_IN2_IDX,
  .filter_thres = CONFIG_ESP32_PCNT_U2_FILTER_THRES,
};

static struct esp32_lowerhalf_s g_pcnt2lower =
{
  .ops      = &g_qecallbacks,
  .config   = &g_pcnt2config,
  .inuse    = false,
};
#endif

#ifdef CONFIG_ESP32_PCNT_U3_QE
static const struct esp32_qeconfig_s g_pcnt3config =
{
  .pcntid        = 3,
  .ch0_gpio      = CONFIG_ESP32_PCNT_U3_CH0_EDGE_PIN,
  .ch1_gpio      = CONFIG_ESP32_PCNT_U3_CH1_LEVEL_PIN,
  .ch0_pulse_sig = PCNT_SIG_CH0_IN3_IDX,
  .ch1_pulse_sig = PCNT_SIG_CH1_IN3_IDX,
  .ch0_ctrl_sig  = PCNT_CTRL_CH0_IN3_IDX,
  .ch1_ctrl_sig  = PCNT_CTRL_CH1_IN3_IDX,
  .filter_thres  = CONFIG_ESP32_PCNT_U3_FILTER_THRES,
};

static struct esp32_lowerhalf_s g_pcnt3lower =
{
  .ops      = &g_qecallbacks,
  .config   = &g_pcnt3config,
  .inuse    = false,
};
#endif

#ifdef CONFIG_ESP32_PCNT_U4_QE
static const struct esp32_qeconfig_s g_pcnt4config =
{
  .pcntid        = 4,
  .ch0_gpio      = CONFIG_ESP32_PCNT_U4_CH0_EDGE_PIN,
  .ch1_gpio      = CONFIG_ESP32_PCNT_U4_CH1_LEVEL_PIN,
  .ch0_pulse_sig = PCNT_SIG_CH0_IN4_IDX,
  .ch1_pulse_sig = PCNT_SIG_CH1_IN4_IDX,
  .ch0_ctrl_sig  = PCNT_CTRL_CH0_IN4_IDX,
  .ch1_ctrl_sig  = PCNT_CTRL_CH1_IN4_IDX,
  .filter_thres  = CONFIG_ESP32_PCNT_U4_FILTER_THRES,
};

static struct esp32_lowerhalf_s g_pcnt4lower =
{
  .ops      = &g_qecallbacks,
  .config   = &g_pcnt4config,
  .inuse    = false,
};
#endif

#ifdef CONFIG_ESP32_PCNT_U5_QE
static const struct esp32_qeconfig_s g_pcnt5config =
{
  .pcntid        = 5,
  .ch0_gpio      = CONFIG_ESP32_PCNT_U5_CH0_EDGE_PIN,
  .ch1_gpio      = CONFIG_ESP32_PCNT_U5_CH1_LEVEL_PIN,
  .ch0_pulse_sig = PCNT_SIG_CH0_IN5_IDX,
  .ch1_pulse_sig = PCNT_SIG_CH1_IN5_IDX,
  .ch0_ctrl_sig  = PCNT_CTRL_CH0_IN5_IDX,
  .ch1_ctrl_sig  = PCNT_CTRL_CH1_IN5_IDX,
  .filter_thres  = CONFIG_ESP32_PCNT_U5_FILTER_THRES,
};

static struct esp32_lowerhalf_s g_pcnt5lower =
{
  .ops      = &g_qecallbacks,
  .config   = &g_pcnt5config,
  .inuse    = false,
};
#endif

#ifdef CONFIG_ESP32_PCNT_U6_QE
static const struct esp32_qeconfig_s g_pcnt6config =
{
  .pcntid        = 6,
  .ch0_gpio      = CONFIG_ESP32_PCNT_U6_CH0_EDGE_PIN,
  .ch1_gpio      = CONFIG_ESP32_PCNT_U6_CH1_LEVEL_PIN,
  .ch0_pulse_sig = PCNT_SIG_CH0_IN6_IDX,
  .ch1_pulse_sig = PCNT_SIG_CH1_IN6_IDX,
  .ch0_ctrl_sig  = PCNT_CTRL_CH0_IN6_IDX,
  .ch1_ctrl_sig  = PCNT_CTRL_CH1_IN6_IDX,
  .filter_thres  = CONFIG_ESP32_PCNT_U6_FILTER_THRES,
};

static struct esp32_lowerhalf_s g_pcnt6lower =
{
  .ops      = &g_qecallbacks,
  .config   = &g_pcnt6config,
  .inuse    = false,
};
#endif

#ifdef CONFIG_ESP32_PCNT_U7_QE
static const struct esp32_qeconfig_s g_pcnt7config =
{
  .pcntid        = 7,
  .ch0_gpio      = CONFIG_ESP32_PCNT_U7_CH0_EDGE_PIN,
  .ch1_gpio      = CONFIG_ESP32_PCNT_U7_CH1_LEVEL_PIN,
  .ch0_pulse_sig = PCNT_SIG_CH0_IN7_IDX,
  .ch1_pulse_sig = PCNT_SIG_CH1_IN7_IDX,
  .ch0_ctrl_sig  = PCNT_CTRL_CH0_IN7_IDX,
  .ch1_ctrl_sig  = PCNT_CTRL_CH1_IN7_IDX,
  .filter_thres  = CONFIG_ESP32_PCNT_U7_FILTER_THRES,
};

static struct esp32_lowerhalf_s g_pcnt7lower =
{
  .ops      = &g_qecallbacks,
  .config   = &g_pcnt7config,
  .inuse    = false,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32_dumpregs
 *
 * Description:
 *   Dump all timer registers.
 *
 * Input Parameters:
 *   priv - A reference to the QENCODER block status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#if defined(CONFIG_DEBUG_SENSORS) && defined(CONFIG_DEBUG_INFO)
static void esp32_dumpregs(struct esp32_lowerhalf_s *priv,
                           const char *msg)
{
  sninfo("%s:\n", msg);
  sninfo("  PCNT_U0_CONF0_REG: 0x08%" PRIx32 ""
         " PCNT_U1_CONF0_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF0_U(0)),
         getreg32(PCNT_CONF0_U(1)));
  sninfo("  PCNT_U2_CONF0_REG: 0x08%" PRIx32 ""
         " PCNT_U3_CONF0_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF0_U(2)),
         getreg32(PCNT_CONF0_U(3)));
  sninfo("  PCNT_U4_CONF0_REG: 0x08%" PRIx32 ""
         " PCNT_U5_CONF0_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF0_U(4)),
         getreg32(PCNT_CONF0_U(5)));
  sninfo("  PCNT_U6_CONF0_REG: 0x08%" PRIx32 ""
         " PCNT_U7_CONF0_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF0_U(6)),
         getreg32(PCNT_CONF0_U(7)));
  sninfo("  PCNT_U0_CONF1_REG: 0x08%" PRIx32 ""
         " PCNT_U1_CONF1_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF1_U(0)),
         getreg32(PCNT_CONF1_U(1)));
  sninfo("  PCNT_U2_CONF1_REG: 0x08%" PRIx32 ""
         " PCNT_U3_CONF1_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF1_U(2)),
         getreg32(PCNT_CONF1_U(3)));
  sninfo("  PCNT_U4_CONF1_REG: 0x08%" PRIx32 ""
         " PCNT_U5_CONF1_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF1_U(4)),
         getreg32(PCNT_CONF1_U(5)));
  sninfo("  PCNT_U6_CONF1_REG: 0x08%" PRIx32 ""
         " PCNT_U7_CONF1_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF1_U(6)),
         getreg32(PCNT_CONF1_U(7)));
  sninfo("  PCNT_U0_CONF2_REG: 0x08%" PRIx32 ""
         " PCNT_U1_CONF2_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF2_U(0)),
         getreg32(PCNT_CONF2_U(1)));
  sninfo("  PCNT_U2_CONF2_REG: 0x08%" PRIx32 ""
         " PCNT_U3_CONF2_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF2_U(2)),
         getreg32(PCNT_CONF2_U(3)));
  sninfo("  PCNT_U4_CONF2_REG: 0x08%" PRIx32 ""
         " PCNT_U5_CONF2_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF2_U(4)),
         getreg32(PCNT_CONF2_U(5)));
  sninfo("  PCNT_U6_CONF2_REG: 0x08%" PRIx32 ""
         " PCNT_U7_CONF2_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CONF2_U(6)),
         getreg32(PCNT_CONF2_U(7)));
  sninfo("  PCNT_U0_CNT_REG: 0x08%" PRIx32 ""
         " PCNT_U1_CNT_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CNT_U(0)),
         getreg32(PCNT_CNT_U(1)));
  sninfo("  PCNT_U2_CNT_REG: 0x08%" PRIx32 ""
         " PCNT_U3_CNT_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CNT_U(2)),
         getreg32(PCNT_CNT_U(3)));
  sninfo("  PCNT_U4_CNT_REG: 0x08%" PRIx32 ""
         " PCNT_U5_CNT_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CNT_U(4)),
         getreg32(PCNT_CNT_U(5)));
  sninfo("  PCNT_U6_CNT_REG: 0x08%" PRIx32 ""
         " PCNT_U7_CNT_REG:  0x08%" PRIx32 "\n",
         getreg32(PCNT_CNT_U(6)),
         getreg32(PCNT_CNT_U(7)));
  sninfo("  PCNT_CTRL_REF: 0x08%" PRIx32 "\n",
         getreg32(PCNT_CTRL_REG));
}
#endif

/****************************************************************************
 * Name: esp32_pcnt2lower
 *
 * Description:
 *   Map a PCNT number to a device structure
 *
 ****************************************************************************/

static struct esp32_lowerhalf_s *esp32_pcnt2lower(int pcnt)
{
  switch (pcnt)
    {
#ifdef CONFIG_ESP32_PCNT_U0_QE
    case 0:
      return &g_pcnt0lower;
#endif
#ifdef CONFIG_ESP32_PCNT_U1_QE
    case 1:
      return &g_pcnt1lower;
#endif
#ifdef CONFIG_ESP32_PCNT_U2_QE
    case 2:
      return &g_pcnt2lower;
#endif
#ifdef CONFIG_ESP32_PCNT_U3_QE
    case 3:
      return &g_pcnt3lower;
#endif
#ifdef CONFIG_ESP32_PCNT_U4_QE
    case 4:
      return &g_pcnt4lower;
#endif
#ifdef CONFIG_ESP32_PCNT_U5_QE
    case 5:
      return &g_pcnt5lower;
#endif
#ifdef CONFIG_ESP32_PCNT_U6_QE
    case 6:
      return &g_pcnt6lower;
#endif
#ifdef CONFIG_ESP32_PCNT_U7_QE
    case 7:
      return &g_pcnt7lower;
#endif
    default:
      return NULL;
    }
}

/****************************************************************************
 * Name: esp32_interrupt
 *
 * Description:
 *   Common timer interrupt handling.  NOTE: Only 16-bit timers require timer
 *   interrupts.
 *
 ****************************************************************************/

#if 0 /* FIXME: To be implemented */
static int esp32_interrupt(int irq, void *context, void *arg)
{
  struct esp32_lowerhalf_s *priv = (struct esp32_lowerhalf_s *)arg;
  uint16_t regval;

  DEBUGASSERT(priv != NULL);

  return OK;
}
#endif

/****************************************************************************
 * Name: esp32_setup
 *
 * Description:
 *   This method is called when the driver is opened.  The lower half driver
 *   should configure and initialize the device so that it is ready for use.
 *   The initial position value should be zero. *
 *
 ****************************************************************************/

static int esp32_setup(struct qe_lowerhalf_s *lower)
{
  struct esp32_lowerhalf_s *priv = (struct esp32_lowerhalf_s *)lower;
  irqstate_t flags;
  uint32_t regval;

  /* Protected access to the registers */

  flags = spin_lock_irqsave(&priv->lock);

  esp32_dumpregs(priv, "Before setup");

