apache/nuttx/arch/xtensa/src/esp32/esp32_qencoder.c
  /* Enable the PCNT Clock and Reset the peripheral */

  modifyreg32(DPORT_PERIP_CLK_EN_REG, 0, DPORT_PCNT_CLK_EN);
  modifyreg32(DPORT_PERIP_RST_EN_REG, 0, DPORT_PCNT_RST);
  modifyreg32(DPORT_PERIP_RST_EN_REG, DPORT_PCNT_RST, 0);

  /* Disable all events */

  putreg32(0, PCNT_CONF0_U(priv->config->pcntid));

  /* Configure the limits range PCNT_CNT_L_LIM | PCNT_CNT_H_LIM */

  regval  = INT16_MIN << 16;
  regval |= INT16_MAX;
  putreg32(regval, PCNT_CONF2_U(priv->config->pcntid));

  /* Setup POS/NEG/LCTRL/HCTRL/FILTER modes */

  regval  = priv->config->filter_thres;
  regval |= PCNT_COUNT_INC << PCNT_CH0_NEG_MODE_U0_S;      /* Ignore Falling-Edge */
  regval |= PCNT_COUNT_DEC << PCNT_CH0_POS_MODE_U0_S;      /* Increase on Rising-Edge */
  regval |= PCNT_MODE_REVERSE << PCNT_CH0_LCTRL_MODE_U0_S; /* Rising A with B in HIGH = CW step */
  regval |= PCNT_MODE_KEEP << PCNT_CH0_HCTRL_MODE_U0_S;    /* Rising A with B in LOW = CCW step */

  putreg32(regval, PCNT_CONF0_U(priv->config->pcntid));

  regval |= PCNT_COUNT_DEC << PCNT_CH1_NEG_MODE_U0_S; /* Ignore Falling-Edge */
  regval |= PCNT_COUNT_INC << PCNT_CH1_POS_MODE_U0_S; /* Increase on Rising-Edge */

  putreg32(regval, PCNT_CONF0_U(priv->config->pcntid));

  /* Configure GPIO pins as Input with Pull-Up enabled */

  esp_configgpio(priv->config->ch0_gpio, INPUT_FUNCTION_3 | PULLUP);
  esp_configgpio(priv->config->ch1_gpio, INPUT_FUNCTION_3 | PULLUP);

  /* Connect Channel A (ch0_gpio) and Channel B (ch1_gpio) crossed for X4 */

  esp_gpio_matrix_in(priv->config->ch0_gpio,
                       priv->config->ch0_pulse_sig, 0);
  esp_gpio_matrix_in(priv->config->ch1_gpio,
                       priv->config->ch0_ctrl_sig, 0);

  esp_gpio_matrix_in(priv->config->ch1_gpio,
                       priv->config->ch1_pulse_sig, 0);
  esp_gpio_matrix_in(priv->config->ch0_gpio,
                       priv->config->ch1_ctrl_sig, 0);

  /* Clear the Reset bit to enable the Pulse Counter */

  regval = getreg32(PCNT_CTRL_REG);
  regval &= ~(1 << (2 * priv->config->pcntid));
  putreg32(regval, PCNT_CTRL_REG);

  esp32_dumpregs(priv, "After setup");

  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Name: esp32_shutdown
 *
 * Description:
 *   This method is called when the driver is closed.  The lower half driver
 *   should stop data collection, free any resources, disable timer hardware,
 *   and put the system into the lowest possible power usage state
 *
 ****************************************************************************/

static int esp32_shutdown(struct qe_lowerhalf_s *lower)
{
  struct esp32_lowerhalf_s *priv = (struct esp32_lowerhalf_s *)lower;

  /* Disable PCNT clock */

  modifyreg32(DPORT_PERIP_CLK_EN_REG, DPORT_PCNT_CLK_EN, 0);

  /* Make sure initial position is 0 */

  priv->position = 0;

  return OK;
}

/****************************************************************************
 * Name: esp32_position
 *
 * Description:
 *   Return the current position measurement.
 *
 ****************************************************************************/

static int esp32_position(struct qe_lowerhalf_s *lower, int32_t *pos)
{
  struct esp32_lowerhalf_s *priv = (struct esp32_lowerhalf_s *)lower;
  irqstate_t flags;
  int32_t position;
  int16_t count;

  DEBUGASSERT(lower && priv->inuse);

  flags = spin_lock_irqsave(&priv->lock);

  position = priv->position;
  count = (int16_t)(getreg32(PCNT_CNT_U(priv->config->pcntid)) & 0xffff);

  /* Return the position measurement */

  *pos = position + count;

  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Name: esp32_setposmax
 *
 * Description:
 *   Set the maximum encoder position.
 *
 ****************************************************************************/

static int esp32_setposmax(struct qe_lowerhalf_s *lower, uint32_t pos)
{
  return -ENOTTY;
}

/****************************************************************************
 * Name: esp32_reset
 *
 * Description:
 *   Reset the position measurement to zero.
 *
 ****************************************************************************/

static int esp32_reset(struct qe_lowerhalf_s *lower)
{
  struct esp32_lowerhalf_s *priv = (struct esp32_lowerhalf_s *)lower;
  irqstate_t flags;
  uint32_t regval;

  sninfo("Resetting position to zero\n");
  DEBUGASSERT(lower && priv->inuse);

  /* Reset this Pulse Counter Unit. */

  flags = spin_lock_irqsave(&priv->lock);

  /* Reset RST bit */

  modifyreg32(PCNT_CTRL_REG, 0, PCNT_CNT_RST_U(priv->config->pcntid));

  /* Clear RST bit to enable counting again */

  modifyreg32(PCNT_CTRL_REG, PCNT_CNT_RST_U(priv->config->pcntid), 0);

  priv->position = 0;

  spin_unlock_irqrestore(&priv->lock, flags);
  return OK;
}

/****************************************************************************
 * Name: esp32_setindex
 *
 * Description:
 *   Set the index pin position
 *
 ****************************************************************************/

static int esp32_setindex(struct qe_lowerhalf_s *lower, uint32_t pos)
{
  return -ENOTTY;
}

/****************************************************************************
 * Name: esp32_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 ****************************************************************************/

static int esp32_ioctl(struct qe_lowerhalf_s *lower, int cmd,
                       unsigned long arg)
{
  /* No ioctl commands supported */

  /* TODO add an IOCTL to control the encoder pulse count prescaler */

  return -ENOTTY;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32_qeinitialize
 *
 * Description:
 *   Initialize a quadrature encoder interface.  This function must be
 *   called from board-specific logic.
 *
 * Input Parameters:
 *   devpath - The full path to the driver to register. E.g., "/dev/qe0"
 *   pcnt    - The PCNT number to used.  'pcnt' must be an element of
 *             {0,1,2,3,4,5,6,7,8}
 *
 * Returned Value:
 *   Zero on success; A negated errno value is returned on failure.
 *
 ****************************************************************************/

int esp32_qeinitialize(const char *devpath, int pcnt)
{
  struct esp32_lowerhalf_s *priv;
  int ret;

  /* Find the pre-allocated timer state structure corresponding to this
   * timer
   */

  priv = esp32_pcnt2lower(pcnt);
  if (priv == NULL)
    {
      snerr("ERROR: PCNT%d support not configured\n", pcnt);
      return -ENXIO;
    }

  /* Make sure that it is available */

  if (priv->inuse)
    {
      snerr("ERROR: PCNT%d is in-use\n", pcnt);
      return -EBUSY;
    }

  /* Register the upper-half driver */

  ret = qe_register(devpath, (struct qe_lowerhalf_s *)priv);
  if (ret < 0)
    {
      snerr("ERROR: qe_register failed: %d\n", ret);
      return ret;
    }

  /* Make sure that the PCNT is in the shutdown state */

  esp32_shutdown((struct qe_lowerhalf_s *)priv);

  /* The driver is now in-use */

  priv->inuse = true;

  return OK;
}

#endif /* CONFIG_SENSORS_QENCODER */
